package homework1;

public class ByteOperation1_3 {
    public static void main(String[] args) {
        byte a = -42; //11010110
        byte b = -15; //11110001
        int x;

        x = ~a;
        System.out.println("~-42= "+ x); // 00101001   41

        x = ~b;
        System.out.println("~-15= "+ x); // 00001110   14

        x = a&b;
        System.out.println("-42&-15 ="+ x); //(11010110 & 11110001) получим 11010000   -48

        x = a|b;
        System.out.println("-42|-15 ="+ x); //(11010110 | 11110001) получим 11110111  -9

        x = a^b;
        System.out.println("-42^-15 ="+ x); // (11010110 ^ 11110001) получим 00100111  39

        x = a>>1;
        System.out.println("-42>>1 ="+x); // (11010110 >> 1) получим 11101011  -21

        x = b>>1;
        System.out.println("-15>>1 ="+x); // (11110001 >> 1) получим 11111000  -8

        x = a<<1;
        System.out.println("-42<<1 ="+x); // (11010110 << 1) получим 10101100  -84

        x = b<<1;
        System.out.println("-15<<1 ="+x); // (11110001 << 1) получим 11100010  -30

        x = a >>> 29;
        System.out.println("-42>>>29 ="+x); // (11010110 >>> 29) получим 00000111   7

        x = b >>> 29;
        System.out.println("-15>>>29 ="+x); // (11110001 >>> 29) получим 00001111   7


        int c = -42; //11010110
        int d = -15; //11110001
        c = c & d;
        System.out.println("-42&=-15 =" +c); //(11010110 &= 11110001) получим 11010000  -48
        d = d & c;
        System.out.println("-15&=-42 =" +d); //(11110001 &= 11010110) получим 11010000  -48

        int e = -42; //11010110
        int f = -15; //11110001
        e = e | f;
        System.out.println("-42|=-15 ="+e); //(11010110 |= 11110001) получим 11110111   -9
        f = f | e;
        System.out.println("-15|=-42 ="+f); //(11110001 |= 11010110) получим 11110111   -9

        int g = -42; //11010110
        int h = -15; //11110001
        g = g ^ h;
        System.out.println("-42^=-15 ="+g); //(11010110 ^ 11110001) получим 00100111  39

        int q = -42; //11010110
        int r = -15; //11110001
        r = r ^ q;
        System.out.println("-15^=-42 ="+r); //(11110001 ^ 11010110) получим 00100111  39

        int i = -42; //11010110
        int j = -15; //11110001
        i = i >> 1;
        System.out.println("-42>>=1 ="+i); // (11010110 >> 1) получим 11101011   -21
        j = j >> 1;
        System.out.println("-15>>=1 ="+j); // (11110001 >> 1) получим 11111000   -8

        int k = -42; //11010110
        int l = -15; //11110001
        k = k << 1;
        System.out.println("-42<<=1 ="+k); // (11010110 << 1) получим 10101100  -84
        l = l << 1;
        System.out.println("-15<<=1 ="+l); // (11110001 << 1) получим 11100010  -30

        int m = -42; //11010110
        int n = -15; //11110001
        n = n >>> 30;
        System.out.println("-15>>>=30 ="+n); // (11110001 >>>= 30) получим 00000011  3
        m = m >>> 30;
        System.out.println("-42>>>=30 ="+m); // (11010110 >>>= 30) получим 00000011  3
    }
}
