package homework1;

public class ByteOperation1_2 {
    public static void main(String[] args) {
        int a = 42; //00101010
        int b = 15; //00001111.
        int x;
        x = ~a;
        System.out.println("~42= "+ x); // 11010101   -43
        x = ~b;
        System.out.println("~15= "+ x); // 11110000   -16
        x = a&b;
        System.out.println("42&15 ="+ x); // (00101010 & 00001111) получим 00001010   10
        x = a|b;
        System.out.println("42|15 ="+ x); // (00101010 | 00001111) получим 00101111   47
        x = a^b;
        System.out.println("42^15 ="+x); // (00101010 ^ 00001111) получим 00100101   37
        x = a>>1;
        System.out.println("42>>1 ="+x); // (00101010 >> 1) получим 00010101   21
        x = b>>1;
        System.out.println("15>>1 ="+x); // (00001111 >> 1) получим 00000111   7
        x = a<<1;
        System.out.println("42<<1 ="+x); // (00101010 << 1) получим 01010100   84
        x = b<<1;
        System.out.println("15<<1 ="+x); // (00001111 << 1) получим 00011110   30
        x = a >>> 2;
        System.out.println("42>>>2 ="+x); // (00101010 >>> 2) получим 00001010  10
        x = b >>> 2;
        System.out.println("15>>>2 ="+x); // (00001111 >>> 2) получим 00000011  3

        int c = 42; //00101010
        int d = 15; //00001111
        c = c & d;
        System.out.println("42&=15 =" +c); // (00101010 &= 00001111) получим 00001010   10
        d = d & c;
        System.out.println("15&=42 =" +d); // (00001111 &= 00101010) получим 00001010   10

        int e = 42; //00101010
        int f = 15; //00001111
        e = e | f;
        System.out.println("42|=15 ="+e); // (00101010 |= 00001111) получим 00101111   47
        f = f | e;
        System.out.println("15|=42 ="+f); // (00001111 |= 00101010) получим 00101111   47

        int g = 42; //00101010
        int h = 15; //00001111
        g = g ^ h;
        System.out.println("42^=15 ="+g); // (00101010 ^ 00001111) получим 00100101   37

        int q = 42; //00101010
        int r = 15; //00001111
        r = r ^ q;
        System.out.println("15^=42 ="+r); // (00001111 ^ 00101010) получим 00100101   37

        int i = 42; //00101010
        int j = 15; //00001111
        i = i >> 1;
        System.out.println("42>>=1 ="+i); // (00101010 >> 1) получим 00010101   21
        j = j >> 1;
        System.out.println("15>>=1 ="+j); // (00001111 >> 1) получим 00000111   7

        int k = 42; //00101010
        int l = 15; //00001111
        k = k << 1;
        System.out.println("42<<=1 ="+k); // (00101010 << 1) получим 01010100   84
        l = l << 1;
        System.out.println("15<<=1 ="+l); // (00001111 << 1) получим 00011110   30

        int m = 42; //00101010
        int n = 15; //00001111
        n = n >>> 2;
        System.out.println("15>>>=2 ="+n); // (00001111 >>> 2) получим 00000011  3
        m = m >>> 2;
        System.out.println("42>>>=2 ="+m); // (00101010 >>> 2) получим 00001010  10

    }
}
